app/controllers/allotments_controller.rb

SELECT "allotments".* FROM "allotments"
---
  def index
    @allotments = Allotment.all

SELECT "ventures".* FROM "ventures"
---
  def new
    @allotment = Allotment.new
    @empreendimentos = Venture.all

SELECT "ventures".* FROM "ventures"
---
  def edit
    @empreendimentos = Venture.all

INSERT INTO "allotments" ("name", "number", "value", "venture_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Lote Pequeno"], ["number", 1], ["value", 100.0], ["venture_id", 1], ["created_at", "2019-08-15 10:14:42.510110"], ["updated_at", "2019-08-15 10:14:42.510110"]]
---
  def create
    @allotment = Allotment.new(allotment_params)

    respond_to do |format|
      if @allotment.save

SELECT  "allotments".* FROM "allotments" WHERE "allotments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_allotment
      @allotment = Allotment.find(params[:id])