app/controllers/contracts_controller.rb

SELECT "contracts".* FROM "contracts"
---
  def index
    @contracts = Contract.all

SELECT "allotments".* FROM "allotments"
---
  def new
    @contract = Contract.new
    @loteamentos = Allotment.all

SELECT "allotments".* FROM "allotments"
---
  def edit
    @loteamentos = Allotment.all

INSERT INTO "contracts" ("number", "total", "date", "client", "formofpayment", "allotment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contract = Contract.new(contract_params)

    respond_to do |format|
      if @contract.save

SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_contract
      @contract = Contract.find(params[:id])