app/controllers/ventures_controller.rb

SELECT "ventures".* FROM "ventures"
---
  def index
    @ventures = Venture.all

INSERT INTO "ventures" ("name", "street", "neighborhood", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Emp 2"], ["street", ""], ["neighborhood", ""], ["city", ""], ["created_at", "2019-08-15 15:37:32.727956"], ["updated_at", "2019-08-15 15:37:32.727956"]]
---
  def create
    @venture = Venture.new(venture_params)

    respond_to do |format|
      if @venture.save

DELETE FROM "ventures" WHERE "ventures"."id" = ?  [["id", 2]]
---
  def destroy
    @venture.destroy

SELECT  "ventures".* FROM "ventures" WHERE "ventures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_venture
      @venture = Venture.find(params[:id])